# Искусственный интеллект Антон, созданный Гилфойлом, взломал сеть умных холодильников. Теперь он использует их в качестве серверов "Пегого дудочника". Помогите владельцу фирмы отыскать все зараженные холодильники.
#
# Для каждого холодильника существует строка с данными, состоящая из строчных букв и цифр, и если в ней присутствует слово "anton" (необязательно рядом стоящие буквы, главное наличие последовательности букв), то холодильник заражен и нужно вывести номер холодильника, нумерация начинается с единицы.
#
# Формат входных данных
# В первой строке подаётся число
# �
# n – количество холодильников. В последующих
# �
# n строках вводятся строки, содержащие латинские строчные буквы и цифры, в каждой строке от
# 5
# 5 до
# 100
# 100 символов.
#
# Формат выходных данных
# Программа должна вывести номера зараженных холодильников через пробел. Если таких холодильников нет, ничего выводить не нужно.

# n = int(input())
# answers = list()
# for i in range(1, n + 1):
#     string = input().strip()
#     if 'a' in string and 'n' in string and 't' in string and 'o' in string and 'n' in string:
#         if string.find('a') < string.find('n') and string.find('n') < string.find('t') and string.find('t') < string.find('o') or string.find('t') < string.rfind('o') and string.find('o') < string.rfind('n'):
#             answers.append(i)
# print(*answers)

virus = 'anton'

for i in range(1, int(input()) + 1):
    s, res = input(), ''
    for j in virus:
        if j in s:
            res += j
            s = s[s.find(j):]

    if res == 'anton':
        print(i, end=' ')

